The main use of eda is to observation is to know about the data set

# Student Performance Indicator

Lifecycle of a mechine learning project

1) Understanding the problem statement
2) Data collection
3) Data Checks to perform
4) Exploratory data analysis
5) Data Pre-Processing
6) Model Training
7) chose the best model

## 1) Problem statement

This project understand how the students performance (test score) is affected by other variable such as Gender,Ethnicity,Parental level of education,Lunch and Test preparation course.

## 2) Data collection

In [2]:
import numpy as np
import pandas as pd
import seaborn as sns
%matplotlib inline
import warnings
warnings.filterwarnings("ignore")

In [6]:
df=pd.read_csv('data/stud.csv')

In [7]:
df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [9]:
df.shape

(1000, 8)

Whant are the data checks to perform on te data set
1) Checking the missing values
2) Check Duplictes
3) Check data types
4) check the number of unique vakues of each column
5) check static in data set
6) check various categories present in diffrent categoricalcolumn

1) Checking the missing values

In [ ]:
df.isna().sum()

gender                         0
race_ethnicity                 0
parental_level_of_education    0
lunch                          0
test_preparation_course        0
math_score                     0
reading_score                  0
writing_score                  0
dtype: int64

There are no missing values in the data set

2) Checking for duplicate values

In [14]:
df.duplicated().sum()

np.int64(0)

3) Checking the data type of the atributes

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race_ethnicity               1000 non-null   object
 2   parental_level_of_education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test_preparation_course      1000 non-null   object
 5   math_score                   1000 non-null   int64
 6   reading_score                1000 non-null   int64
 7   writing_score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

4) Checking the number of unique vlues in each column

In [16]:
df.nunique()

gender                          2
race_ethnicity                  5
parental_level_of_education     6
lunch                           2
test_preparation_course         2
math_score                     81
reading_score                  72
writing_score                  77
dtype: int64

5) Statistics of data set

In [17]:
df.describe()

       math_score  reading_score  writing_score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [36]:
print('catogory in gender  ',end='')
print(df['gender'].unique())
print('catogory in  race_ethnicity ', end='')
print(df['race_ethnicity'].unique())
print('catogory in  parental_level_of_education ', end='')
print(df['parental_level_of_education'].unique())
print('catogory in lunch  ', end='')
print(df['lunch'].unique())
print('catogory in test_preparation_course', end='')
print(df['test_preparation_course'].unique())
print('catogory in math_score ', end='')
print(df['math_score'].unique())
print('catogory in reading_score ', end='')
print(df['reading_score'].unique())
print('writing_score', end='')
print(df['writing_score'].unique())

catogory in gender  ['female' 'male']
catogory in  race_ethnicity ['group B' 'group C' 'group A' 'group D' 'group E']
catogory in  parental_level_of_education ["bachelor's degree" 'some college' "master's degree" "associate's degree"
 'high school' 'some high school']
catogory in lunch  ['standard' 'free/reduced']
catogory in test_preparation_course['none' 'completed']
catogory in math_score [ 72  69  90  47  76  71  88  40  64  38  58  65  78  50  18  46  54  66
  44  74  73  67  70  62  63  56  97  81  75  57  55  53  59  82  77  33
  52   0  79  39  45  60  61  41  49  30  80  42  27  43  68  85  98  87
  51  99  84  91  83  89  22 100  96  94  48  35  34  86  92  37  28  24
  26  95  36  29  32  93  19  23   8]
catogory in reading_score [ 72  90  95  57  78  83  43  64  60  54  52  81  53  75  89  32  42  58
  69  73  71  74  70  65  87  56  61  84  55  44  41  85  59  17  39  80
  37  63  51  49  26  68  45  47  86  34  79  66  67  91 100  76  77  82
  92  93  62  88  50  28  48  46  23  38  94  97  99  31  96  24  29  40]
writing_score[ 74  88  93  44  75  78  92  39  67  50  52  43  73  70  58  86  28  46
  61  63  53  80  72  55  65  38  82  79  83  59  57  54  68  66  62  76
  48  42  87  49  10  34  71  37  56  41  22  81  45  36  89  47  90 100
  64  98  51  40  84  69  33  60  85  91  77  27  94  95  19  35  32  96
  97  99  15  30  23]

define numerical and catogorical columns

In [41]:
numerical_features =[f for f in df.columns if df[f].dtype !='O'] 
categorical_features =[f for f in df.columns if df[f].dtype =='O'] 

print('The  Numerical features {},{}'.format(len(numerical_features),numerical_features))
print('The  Categorical features {},{}'.format(len(categorical_features),categorical_features))

The  Numerical features 3,['math_score', 'reading_score', 'writing_score']
The  Categorical features 5,['gender', 'race_ethnicity', 'parental_level_of_education', 'lunch', 'test_preparation_course']

In [42]:
df['Total_score']=df['math_score']+df['reading_score']+df['writing_score']
df['Average_score']=df['Total_score']/3

df.head()

,gender,race_ethnicity,parental_level_of_education,lunch,test_preparation_course,math_score,reading_score,writing_score,Total_score,Average_score
0,female,group B,bachelor's degree,standard,none,72,72,74,218,72.666667
1,female,group C,some college,standard,completed,69,90,88,247,82.333333
2,female,group B,master's degree,standard,none,90,95,93,278,92.666667
3,male,group A,associate's degree,free/reduced,none,47,57,44,148,49.333333
4,male,group C,some college,standard,none,76,78,75,229,76.333333

In [46]:
reading_full = df[df['reading_score'] == 100]['Average_score'].count()
writing_full = df[df['writing_score'] == 100]['Average_score'].count()
math_full = df[df['math_score'] == 100]['Average_score'].count()

print('Number of students who scored full marks in reading: ', reading_full)
print('Number of students who scored full marks in writing: ', writing_full)
print('Number of students who scored full marks in math_full: ', math_full)

Number of students who scored full marks in reading:  17
Number of students who scored full marks in writing:  14
Number of students who scored full marks in math_full:  7

In [49]:
reading_full = df[df['reading_score'] <= 20]['Average_score'].count()
writing_full = df[df['writing_score'] <= 20]['Average_score'].count()
math_full = df[df['math_score'] <= 20]['Average_score'].count()

print('Number of students who scored full marks in reading_least: ', reading_full)
print('Number of students who scored full marks in writing_least: ', writing_full)
print('Number of students who scored full marks in math_full_east: ', math_full)

Number of students who scored full marks in reading_least:  1
Number of students who scored full marks in writing_least:  3
Number of students who scored full marks in math_full_east:  4

### Insights

From the above we can say that the student perfomed best in reading and worst in  math.

 # Exploring Data Visualization